N = int(input())

dp = [1, 2]
ans = 1

for i in range(1, N):
    if i == 1:
        # dp[i] = 2
        ans += 2
    else:
        # dp[i] = dp[i-1]*2 + dp[i-2]
        ans += dp[1]*2 + dp[0]
        tmp = dp[1]*2 + dp[0]
        dp.pop(0)
        dp.append(tmp)

print((ans*2 + 1)%9901)

##################
# 1, 7, 13, 7, 1 => 29     =>     29 = 12 + 5*2 + 2*2 + 1*2 + 1     =>     12 + 10 + 4 + 2 + 1     =>     29 => 12*2 + 5
# 1, 5, 5, 1 => 12
# 1, 3, 1 => 5
# 1, 1 => 2
# 1
#################

# N = int(input())

# dp = [1]*N

# for i in range(1, N):
#     if i == 1:
#         dp[i] = 2
#     else:
#         tmp = 1
#         tmp += dp[i-1]
#         for j in range(i-1):
#             tmp += 2*dp[j]
#         dp[i] = tmp

# print((sum(dp)*2+1)%9901)

##################
# 1, 7, 13, 7, 1 => 29     =>    29 = 12 + 5*2 + 2*2 + 1*2 + 1    =>     12 + 10 + 4 + 2 + 1    =>     29 => 12*2 + 5
# 1, 5, 5, 1 => 12
# 1, 3, 1 => 5
# 1, 1 => 2
# 1
#################





# print((sum(dp)*2 + 1)%9901)

# N = int(input())

# dp = [[1]*(i+1) for i in range(N)]

# for i in range(1, N-1):
#     for j in range(i, N):
#         tmp = dp[j-1][i-1]
#         for k in range(i-1, j-1):
#             tmp += 2*(dp[k][i-1])
#         dp[j][i] = tmp

# ans = 0
# for d in dp:
#     ans += sum(d)

# print((ans*2+1)%9901)

################## (r번째 행에는 무조건 r번째에 사자가 포함되어 있어야 함)
# 1, 7, 13, 7, 1
# 1, 5, 5, 1
# 1, 3, 1   (이전 행에 2마리가 나온 경우*1 + 밑의 총 경우의 수)
# 1, 1
# 1
#################

##################
# 0, 0
# 0, 0
# 0, 1
# 0, 0
# 0, 0
#################


        
        
